In [13]:
import pandas as pd

bus_data = pd.read_csv('DATA_daily_2023.csv', encoding='EUC-KR')

In [14]:
#버스데이터 필터링
bus_data.head(2)

,사용일자,노선번호,노선명,표준버스정류장ID,버스정류장ARS번호,역명,승차총승객수,하차총승객수,등록일자
0,20230901,관악02,관악02(낙성대역~서울대신공학관),120000172.0,21274,신소재연구소(00019),8.0,69.0,20230904.0
1,20230901,관악02,관악02(낙성대역~서울대신공학관),120000173.0,21275,제2공학관(00022),689.0,528.0,20230904.0

In [19]:
#승하차 인원 날짜별로 집계 : 일단 모든 정류장
daily_bus_data = bus_data.groupby('사용일자').agg({'승차총승객수': 'sum', '하차총승객수': 'sum'}).reset_index()
daily_bus_data.head(2)

       사용일자  승차총승객수  하차총승객수
0  20230101  3581.0  3496.0
1  20230102  7551.0  7400.0

In [22]:
daily_bus_data.rename(columns={
    '사용일자': 'Date',
    '승차총승객수': 'boarding_count',
    '하차총승객수': 'alighting_count',}, inplace=True)

In [23]:
daily_bus_data

         date  boarding_count  alighting_count
0    20230101          3581.0           3496.0
1    20230102          7551.0           7400.0
2    20230103          7804.0           7654.0
3    20230104          8299.0           8100.0
4    20230105          8026.0           7836.0
..        ...             ...              ...
356  20231227          8510.0           8351.0
357  20231228          8182.0           8045.0
358  20231229          7889.0           7732.0
359  20231230          5091.0           4985.0
360  20231231          3267.0           3226.0

[361 rows x 3 columns]

In [18]:
event_data = pd.read_csv('snu_crawling_2023.csv')
event_data.head(2)

       Date                       Event
0  20230301                     제1학기 시작
1  20230302  제1학기 개강, 입학식, 제1학기 수강신청 변경

In [ ]:
combined_data = pd.merge(bus_data, event_data, on='date', how='left')